# Brewfile - Homebrew Bundle file for macOS package management
# Install with: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Formulae (CLI tools)
brew "git"
brew "zsh"
brew "vim"
brew "neovim"
brew "tmux"
brew "wget"
brew "curl"
brew "htop"
brew "tree"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "exa"
brew "fzf"
brew "gh"  # GitHub CLI
brew "node"
brew "python"

# Casks (GUI applications)
cask "visual-studio-code"
cask "iterm2"
cask "google-chrome"
cask "slack"
cask "docker"
cask "rectangle"  # Window management

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

# Mac App Store applications (requires mas CLI)
brew "mas"
