# Brewfile - Homebrew Bundle file for macOS package management
# Install with: brew bundle install

# Formulae (CLI tools)
brew "git"
brew "zsh"
brew "wget"
brew "curl"
brew "htop"
brew "tree"
brew "jq"
brew "gh"  # GitHub CLI
brew "node"
brew "python"
brew "starship"  # Cross-shell prompt

# Casks (GUI applications)
cask "visual-studio-code"
cask "orbstack"
cask "github-desktop"
cask "tailscale"
cask "busycal"
cask "yubico-authenticator"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"

# Mac App Store applications (requires mas CLI)
brew "mas"
mas "1Password for Safari", id: 1569813296
mas "Drafts", id: 1435957248
mas "Magnet", id: 441258766
mas "Soulver 3", id: 1402746188
mas "Todoist", id: 944424958
mas "Things", id: 904280696
mas "Windows App", id: 1295203466
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
